; domain
(define (domain gripper-strips)

    (:predicates (room ?r)
                (ball ?b)
                (gripper ?g)
                (at-robby ?r)
                (at ?b ?r)
                (free ?g)
                (carry ?o ?g)
    )

    (:action move
        :parameters (?from ?to)
        :precondition (and (room ?from)(room ?to)(at-robby ?from))
        :effect (and
            (at-robby ?to)
            (not (at-robby ?from))
        )
    )
    (:action pick
        :parameters (?obj ?room ?gripper)
        :precondition (and (ball ?obj)(room ?room)(gripper ?gripper)(at ?obj ?room)(at-robby ?room)(free ?gripper))
        :effect (and
            (carry ?obj ?gripper)
            (not (at ?obj ?room))
            (not (free ?gripper))
        )
    )
    (:action drop
        :parameters (?obj ?room ?gripper)
        :precondition (and (ball ?obj)(room ?room)(gripper ?gripper)(carry ?obj ?gripper)(at-robby ?room))
        :effect (and
            (at ?obj ?room)
            (free ?gripper)
            (not (carry ?obj ?gripper))
        )
    )
)

; problem
(define (problem gripper-4)
(:domain gripper-strips)
(:objects rooma roomb room3 room4 room5 room6 left right ball1 ball2 ball3 ball4 )
(:init
(room rooma)
(room roomb)
(room room3)
(room room4)
(room room5)
(room room6)
(gripper left)
(gripper right)
(ball ball1)
(ball ball2)
(ball ball3)
(ball ball4)
(free left)
(free right)
(at ball1 rooma)
(at ball2 rooma)
(at ball3 room4)
(at ball4 room6)
(at-robby rooma)
)
(:goal
(and
(at ball1 room5)
(at ball2 room5)
(at ball3 room5)
(at ball4 room5)
)
)
)

; plan
1. (pick ball2 rooma left)
   deleted: (at ball2 rooma) (free left)
   added: (carry ball2 left)
   goals met: 0 of 4
2. (pick ball1 rooma right)
   deleted: (at ball1 rooma) (free right)
   added: (carry ball1 right)
   goals met: 0 of 4
3. (move rooma room6)
   deleted: (at-robby rooma)
   added: (at-robby room6)
   goals met: 0 of 4
4. (move room6 room5)
   deleted: (at-robby room6)
   added: (at-robby room5)
   goals met: 0 of 4
5. (drop ball1 room5 right)
   deleted: (carry ball1 right)
   added: (at ball1 room5) (free right)
   goals met: 1 of 4
6. (drop ball2 room5 left)
   deleted: (carry ball2 left)
   added: (at ball2 room5) (free left)
   goals met: 2 of 4
7. (move room5 room6)
   deleted: (at-robby room5)
   added: (at-robby room6)
   goals met: 2 of 4
8. (pick ball4 room6 left)
   deleted: (at ball4 room6) (free left)
   added: (carry ball4 left)
   goals met: 2 of 4
9. (move room6 room5)
   deleted: (at-robby room6)
   added: (at-robby room5)
   goals met: 2 of 4
10. (drop ball4 room5 left)
   deleted: (carry ball4 left)
   added: (at ball4 room5) (free left)
   goals met: 3 of 4
11. (move room5 room4)
   deleted: (at-robby room5)
   added: (at-robby room4)
   goals met: 3 of 4
12. (pick ball3 room4 left)
   deleted: (at ball3 room4) (free left)
   added: (carry ball3 left)
   goals met: 3 of 4
13. (move room4 room5)
   deleted: (at-robby room4)
   added: (at-robby room5)
   goals met: 3 of 4
14. (drop ball3 room5 left)
   deleted: (carry ball3 left)
   added: (at ball3 room5) (free left)
   goals met: 4 of 4
